app/controllers/favorites_controller.rb

  def index
    @favorites = current_user.favorites.all
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 3]]

  def create
    favorite = current_user.favorites.create(picture_id: params[:picture_id])
---
INSERT INTO "favorites" ("user_id", "picture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["picture_id", 11], ["created_at", "2020-02-01 13:16:47.751163"], ["updated_at", "2020-02-01 13:16:47.751163"]]

  def destroy
    favorite = current_user.favorites.find_by(id: params[:id]).destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]