app/controllers/pictures_controller.rb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."picture_id" = $2 LIMIT $3  [["user_id", 58], ["picture_id", 1], ["LIMIT", 1]]
---
  def show
    @favorite = current_user.favorites.find_by(picture_id: @picture.id)

INSERT INTO "pictures" ("title", "content", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "aaaa"], ["content", "aaaaa"], ["image", "img_lineup05.jpg"], ["user_id", 1], ["created_at", "2020-01-26 18:05:28.094168"], ["updated_at", "2020-01-26 18:05:28.094168"]]
---
  def create
    @picture = current_user.pictures.build(picture_params)
    if params[:back]
      render :new
    else
      respond_to do |format|
        if @picture.save

UPDATE "pictures" SET "image" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["image", "NIS584hashibirokou_TP_V.jpg"], ["updated_at", "2020-02-02 16:29:04.593805"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @picture.update(picture_params)

DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 3]]
---
  def destroy
    @picture.destroy

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_picture
      @picture = Picture.find(params[:id])