app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = $1, "image" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$10$7eDv3ak3S/0I0h6UzpB7UezukfME4fIXdVSyRNM2ET547I10a8Qpq"], ["image", "img_lineup05.jpg"], ["updated_at", "2020-01-27 06:36:34.962109"], ["id", 58]]